---
kind: method
id: M:Autodesk.Revit.DB.ReferenceArrayArray.Insert(Autodesk.Revit.DB.ReferenceArray,System.Int32)
source: html/66231c0c-d67a-ebab-e4fa-82c984a29b20.htm
---
# Autodesk.Revit.DB.ReferenceArrayArray.Insert Method

## Syntax (C#)
```csharp
public virtual void Insert(
	ReferenceArray item,
	int index
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.ReferenceArray`)
- **index** (`System.Int32`)